---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.IsSurfaceBackgroundPatternVisible
source: html/cc7da645-38b1-a0f6-4b32-f455f6354691.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.IsSurfaceBackgroundPatternVisible Property

The visibility of the surface background fill pattern.

## Syntax (C#)
```csharp
public bool IsSurfaceBackgroundPatternVisible { get; }
```